backend/src/tests/api-load-test.yaml
config:
  target: http://localhost:4000
  phases:
    - duration: 20
      arrivalRate: 15 # create 15 users every second for 20 seconds
      name: Startup phase
      rampTo: 40
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.max: 1000
    conditions:
      - expression: "http.codes.200 == http.requests"
scenarios:
  - flow:
    - get:
        url: "/api/neighborhoods"